
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ИзменениеМетодаСписанияСебестоимости
	Движения.ИзменениеМетодаСписанияСебестоимости.Записывать = Истина;
	Движение = Движения.ИзменениеМетодаСписанияСебестоимости.Добавить();
	Движение.Период = Дата;
	Движение.ДокументОснование = Ссылка;
	Движение.МетодСписанияСебестоимости = МетодСписанияСебестоимости;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
