Функция РасчетСебестоимостиТоваров(Номенклатура) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыНаСкладахОстатки.КоличествоОстаток КАК КоличествоОстаток,
		|	ЗакупочныеЦеныСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(, Номенклатура = &Номенклатура) КАК ТоварыНаСкладахОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗакупочныеЦены.СрезПоследних КАК ЗакупочныеЦеныСрезПоследних
		|		ПО ТоварыНаСкладахОстатки.Номенклатура = ЗакупочныеЦеныСрезПоследних.Номенклатура
		|			И ТоварыНаСкладахОстатки.Характеристика = ЗакупочныеЦеныСрезПоследних.Характеристика";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Сумма = 0;
	Количество = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Сумма = Сумма + ВыборкаДетальныеЗаписи.КоличествоОстаток * ВыборкаДетальныеЗаписи.Цена;
		Количество = Количество + ВыборкаДетальныеЗаписи.КоличествоОстаток;
	КонецЦикла;
	
	СредняяЗакупочнаяЦена = Сумма / Количество;
	Возврат СредняяЗакупочнаяЦена;

	
КонецФункции

Функция ОпределениеХарактеристики(Номенклатура, Количество, МетодСписания) Экспорт
	Если МетодСписания = Справочники.МетодыСписанияСебестоимости.FIFO Тогда	
	

	ИначеЕсли МетодСписания = Справочники.МетодыСписанияСебестоимости.LIFO Тогда
		
	ИначеЕсли МетодСписания = Справочники.МетодыСписанияСебестоимости.ПоСреднему Тогда
		
	КонецЕсли;
КонецФункции

Функция ОпределениеМетодаСписания(ДатаДок) Экспорт
	
	МетодыСписания = РегистрыСведений.ИзменениеМетодаСписанияСебестоимости;
	ТекМетодСписания = МетодыСписания.ПолучитьПоследнее(ДатаДок);
		
	Возврат ТекМетодСписания.МетодСписанияСебестоимости.Наименование; 
	

КонецФункции

// Упорядочиваем характеристики товаров в регистре товары на складах в зависимости от метода списания
Функция УпорядочитьХарактеристикиНоменклатуры(Номенклатура, Метод) Экспорт
	Запрос = Новый Запрос;
	Если Метод = Справочники.МетодыСписанияСебестоимости.FIFO.Наименование или Метод = Справочники.МетодыСписанияСебестоимости.ПоСреднему.Наименование Тогда
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыНаСкладахОстатки.Характеристика КАК Характеристика
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(, Номенклатура = &Номенклатура) КАК ТоварыНаСкладахОстатки
		|
		|УПОРЯДОЧИТЬ ПО
		|	Характеристика";

	
	ИначеЕсли  Метод = Справочники.МетодыСписанияСебестоимости.LIFO.Наименование Тогда
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыНаСкладахОстатки.Характеристика КАК Характеристика
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(, Номенклатура = &Номенклатура) КАК ТоварыНаСкладахОстатки
		|
		|УПОРЯДОЧИТЬ ПО
		|	Характеристика УБЫВ" ;
			
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СписокЗначенийХарактеристик = Новый Массив;
	Если ВыборкаДетальныеЗаписи.Количество()>0 Тогда
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Если ТипЗнч(ВыборкаДетальныеЗаписи.Характеристика) = Тип("ДокументСсылка.ПоступлениеТоваровУслуг") Тогда
			СписокЗначенийХарактеристик.Добавить(ВыборкаДетальныеЗаписи.Характеристика)
		КонецЕсли;
	КонецЦикла;
	Возврат СписокЗначенийХарактеристик;
	Иначе
		Сообщить("Отсутствует товар "+ Номенклатура + " на складе"); 
		Возврат Ложь;
	КонецЕсли
	
КонецФункции

Функция СредняяЦена(Номенклатура) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыНаСкладахОстатки.Характеристика КАК Характеристика,
		|	ЗакупочныеЦеныСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(, Номенклатура = &Номенклатура) КАК ТоварыНаСкладахОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗакупочныеЦены.СрезПоследних КАК ЗакупочныеЦеныСрезПоследних
		|		ПО ТоварыНаСкладахОстатки.Номенклатура = ЗакупочныеЦеныСрезПоследних.Номенклатура
		|ГДЕ
		|	ТоварыНаСкладахОстатки.КоличествоОстаток > 0" ;		
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	СрЦена = 0;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СрЦена = СрЦена + ВыборкаДетальныеЗаписи.Цена				
	КонецЦикла;
		СрЦена = СрЦена / ВыборкаДетальныеЗаписи.Количество;
		Возврат СрЦена;
КонецФункции

Функция МодульЧисла(Значение) Экспорт
	Возврат Макс(Значение, -Значение);
КонецФункции